import random

def generate_phone_ru():
    # популярные коды операторов РФ
    codes = [
        900, 901, 902, 903, 904, 905, 906, 907, 908, 909,
        910, 911, 912, 913, 914, 915, 916, 917, 918, 919,
        920, 921, 922, 923, 924, 925, 926, 927, 928, 929,
        930, 931, 932, 933, 934, 936, 937, 938, 939,
        950, 951, 952, 953, 954, 955, 956, 957, 958, 959,
        960, 961, 962, 963, 964, 965, 966, 967, 968, 969,
        980, 981, 982, 983, 984, 985, 986, 987, 988, 989
    ]

    code = random.choice(codes)
    number = random.randint(10**6, 10**7 - 1)  # последние 7 цифр
    return f"8{code}{number}"


print(generate_phone_ru())
print(random.randint(10**10, 10**11 - 1))
print(random.randint(10**15, 10**16 - 1))

